eduardo-bn/ArduinoCore-samd/boards.txt
# PAYG Ilumexico rev F4
# --------------------
payg_ilumexico_f4.name=PAYG Ilumexico rev F4
payg_ilumexico_f4.vid.0=0x2341
payg_ilumexico_f4.pid.0=0x8050
payg_ilumexico_f4.vid.1=0x2341
payg_ilumexico_f4.pid.1=0x0050

payg_ilumexico_f4.upload.tool=bossac
payg_ilumexico_f4.upload.protocol=sam-ba
payg_ilumexico_f4.upload.maximum_size=262144
payg_ilumexico_f4.upload.use_1200bps_touch=true
payg_ilumexico_f4.upload.wait_for_upload_port=true
payg_ilumexico_f4.upload.native_usb=true
payg_ilumexico_f4.build.mcu=cortex-m0plus
payg_ilumexico_f4.build.f_cpu=48000000L
payg_ilumexico_f4.build.usb_product="PAYG Ilumexico rev F4"
payg_ilumexico_f4.build.usb_manufacturer="Ilumexico"
payg_ilumexico_f4.build.board=SAMD_PAYG_Ilumexico_F4
payg_ilumexico_f4.build.core=arduino
payg_ilumexico_f4.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
payg_ilumexico_f4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
payg_ilumexico_f4.build.openocdscript=openocd_scripts/arduino_zero.cfg
payg_ilumexico_f4.build.variant=payg_ilumexico_f4
payg_ilumexico_f4.build.vid=0x2341
payg_ilumexico_f4.build.pid=0x8050
payg_ilumexico_f4.bootloader.tool=openocd
payg_ilumexico_f4.bootloader.file=mkrfox1200/samd21_sam_ba_arduino_mkrfox1200.bin
